"use client";
import { Carousel, Card } from "@/components/ui/apple-cards-carousel";

const doctors = [
  {
    name: "Проф. д-р Миглена Георгиева",
    photo: "/georgieva.jpg",
    content: (
      <div className="text-base text-gray-800 leading-relaxed">
        Родена в гр. Варна, през 1961 г. Възпитаник е на IV ЕГ &quot;Фредерик
        Жолио Кюри&quot; с преподаване на френски език, която завършва с отличен
        успех. Завършва медицина през 1986 г. в Ленинград - &quot;Ленинградски
        педиатрически медицински институт&quot; с пълно отличие. През 1996 г.
        защитава дисертация в областта на детската гастроентерология. През 1992
        г. придобива специалност по детски болести. През 2005 г. - специалност
        по детска гастроентерология. През 2010 г. се хабилитира към Катедрата по
        педиатрия и медицинска генетика - МУ &quot;Проф. д-р П. Стоянов&quot;.
        През 2018 г. придобива специалност по хранене и диететика. От 1.04.2014
        г. и понастоящем е Началник Втора детска клиника към УМБАЛ „Света
        Марина“ - Варна. Работи в областта на детската гастроентерология и
        хранене. Има специализации в Полша, Словения, Испания и Австрия,
        Великобритания. Специалист по педиатрия, детска гастроентерология,
        хранене и диететика. Има над 230 участия и публикация в научни конгреси
        у нас и в чужбина. Работи в областта на заболявания на горния и долен
        храносмилателен тракт, хеликобактер пилори инфекция, чернодробна
        патология, хранителна алергия, приложение на пробиотиците и др.
      </div>
    ),
  },
  {
    name: "Д-р Ния Рашева",
    photo: "/rasheva.jpg",
    content: (
      <div className="text-base text-gray-800 leading-relaxed">
        Детски болести на гастроентералния тракт, рефлукс, хепатити, болки в
        корема, повръщане , запек.
      </div>
    ),
  },
  {
    name: "Д-р Мартина Гълъбова",
    photo: "/galabova.jpg",
    content: (
      <div className="text-base text-gray-800 leading-relaxed">
        Родена в град Бургас, специалист по педиатрия, детска пневмология и
        фтизиатрия, алергология. Завършва I Езикова Гимназия с преподаване на
        английски и немски език - гр. Варна през 1993 г. През 1999 г. се
        дипломира в Медицински университет &quot;Проф. д-р Параскев
        Стоянов&quot; - гр. Варна и е отличник на випуска. 1999 – 2020 г. работи
        във Втора детска клиника на УМБАЛ &quot;Света Марина&quot; като лекар
        асистент. От 2000 г. до момента е асистент в Катедра по Педиатрия на МУ
        &quot;Проф. д-р Параскев Стоянов&quot; - гр. Варна. През 2004 г.
        придобива специалност по Детски болести, през 2006 г. по Клинична
        алергология, а през 2013 г. по Детска пневмология и фтизиатрия Има над
        40 публикации в български и чуждестранни списания и над 30 участия в
        научни форуми в България и чужбина. Основни научни интереси в областта
        на детската пневмология и алергология.
      </div>
    ),
  },
  {
    name: "Д-р Мариана Москова",
    photo: "/moskova.jpg",
    content: (
      <div className="text-base text-gray-800 leading-relaxed">
        Д-р Мариана Москова е специалист детски ендокринолог и педиатър в Русе и
        Варна с над 20 години опит. Извършва прегледи, диагностика и лечение на
        деца с общи и ендокринологични проблеми.
        <br />
        <br />
        <b>Образование:</b> Учила медицина в Ленинградски педиатричен институт
        през 1986 г. Своите специалности Детски болести и Детска ендокринология
        и болести на обмяната придобива съответно през 1992 г. в Медицински
        университет София и през 2011 г. в Медицински университет Варна.
        <br />
        <br />
        <b>Квалификации:</b> Член на Българската педиатрична асоциация,
        Българско национално сдружение по детска ендокринология, Българско
        дружество по ендокринология и Варненско дружество по детска
        ендокринология; Участия в множество конкурси, конференции и конгреси за
        педиатрична квалификация; Владее английски и руски език.
        <br />
        <br />
        <b>Биография:</b> В годините между 1986 г. и 1997 г. д-р Москова работи
        последователно като участъков педиатър, ординатор в Неонатологично
        отделение и ординатор във Второ детско кърмаческо отделение към Окръжна
        болница Русе. От 1997 г. до 2008 г. е ординатор, след това Началник
        отделение в Дом за медико-социални грижи за деца Добрич. В периода
        2008-2010г. е клиничен ординатор по детска ендокринология в УМБАЛ
        &quot;Св. Марина&quot; Варна, а от 2011 г. до 2019 г. е педиатър и
        детски ендокринолог в Отделение по педиатрия на МБАЛ Добрич. От 2016 г.
        е част от екипа специалисти на ДКЦ 2 - Медика като детски ендокринолог.
      </div>
    ),
  },
  {
    name: "Д-р Мартин Бояджиев",
    photo: "/boyadzhiev.jpg",
    content: (
      <div className="text-base text-gray-800 leading-relaxed">
        Д-р Мартин Бояджиев е специалист детски ревматолог във Варна с над 9
        години медицински опит с интереси в областта на диагностиката и
        лечението на автоинфламаторни заболявания, периодични синдроми и
        васкулити. Извършва диагностика и лечение на ревматологични заболявания,
        възпалителни и дегенеративни ставни заболявания, системни заболявания на
        съединителната тъкан и др.
        <br />
        <br />
        <b>Образование:</b> Дипломира се в Медицински университет София през
        2013 г. Своята специалност по Детска ревматология придобива през 2018 г.
        <br />
        <br />
        <b>Квалификации:</b> Ставна ехография; Автор и съавтор на научни статии
        в български и чуждестранни издания; Участие в научни форуми и конгреси в
        страната и чужбина; Специализации в София и Great North Children’s
        Hospital, Newcastle upon Tyne, Великобритания; Член на Paediatric
        Rheumatology International Trials Organisation и Български лекарски
        съюз.
        <br />
        <br />
        <b>Биография:</b> От 2014 г. д-р Бояджиев работи в УМБАЛ Света Марина
        Варна, а от 2018 г. е асистент към катедра Педиатрия на Медицински
        университет Варна, където е и редовен докторант. Практикувал е в МЦ
        Санита. Към момента е част от екипа специалисти на МЦ Хигия.
      </div>
    ),
  },
];

export default function TeamCards() {
  return (
    <div className="w-full flex flex-col items-center py-10 pb-32">
      {" "}
      {/* Add pb-32 for footer space */}
      <Carousel
        items={doctors.map((doctor) => (
          <Card
            key={doctor.name}
            card={{
              src: doctor.photo,
              title: doctor.name,
              content: doctor.content,
            }}
            index={0}
            // Remove any blur prop if present
          />
        ))}
      />
    </div>
  );
}
